cruise-control/stm32n6_nucleo_base/Modules/DummyApp/Dummy.cpp
#include <stdio.h>
#include "Dummy.hpp"
#include "FreeRTOS.h"
#include "task.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_nucleo.h"
#include "etl/array.h"

static StaticTask_t main_thread;
static StackType_t main_thread_stack[configMINIMAL_STACK_SIZE];

static void main_thread_fct(void *arg)
{
  TickType_t last_tick = xTaskGetTickCount();
  TickType_t xFrequency = 200;
  etl::array<uint8_t,20> arr = {};

  printf("Entering Dummy FreeRTOS Thread\n");
  for (auto &&i : arr)
    {
      printf("%d", i);
    }

  while (1)
  {
    BSP_LED_Toggle(LED_BLUE);
    xTaskDelayUntil(&last_tick, xFrequency);
  }

  printf("Exiting Dummy FreeRTOS Thread\n");

  vTaskDelete(NULL);
}

void dummy_func()
{
  TaskHandle_t hdl;
  hdl = xTaskCreateStatic(main_thread_fct, "dummy", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1,
                          main_thread_stack, &main_thread);
  assert(hdl != NULL);
  printf("Dummy Func\n");
}
